VPro/src/Documents/LoanContract/LoanContract.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanContract</name>
  <basedOn>Catalog.Employees</basedOn>
  <registerRecords>InformationRegister.LoanRepaymentSchedule</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LoanKind</name>
    <type>
      <types>EnumRef.LoanContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InterestRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ChargeFromSalary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RepaymentOption</name>
    <type>
      <types>EnumRef.OptionsOfLoanRepaymentByEmployee</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Maturity</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRepayment</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessArea</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>InterestGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CostAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionType</name>
    <type>
      <types>EnumRef.LoanCommissionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Commission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTerms</name>
    <type>
      <types>EnumRef.LoanRepaymentTerms</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Order</name>
    <type>
      <types>DocumentRef.CustomerOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionPrincipalDebt</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionInterest</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysInYear360</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentAndAccrualSchedule</name>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Principal</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Interest</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Commission</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/Enums/LoanAccrualTypes/LoanAccrualTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanAccrualTypes</name>
  <enumValues>
    <name>AccrualsForEmployeeLoans</name>
  </enumValues>
  <enumValues>
    <name>AccrualsForLoansBorrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/LoanContract/Forms/ChoiceForm/Module.bsl
#Region FormEventHandlers

// Procedure - handler of the WhenCreatingOnServer event of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("CompanyForFilter") AND Not Constants.AccountingBySubsidiaryCompany.Get() Then
		Parameters.Filter.Insert("Company", Parameters.CompanyForFilter);
	EndIf;
	
	If Parameters.Property("CounterpartyForFilter") 
		AND ValueIsFilled(Parameters.CounterpartyForFilter)
		AND ((Parameters.Property("OperationType")
				AND Parameters.OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed)
			OR Not Parameters.Property("OperationType")) Then
				Parameters.Filter.Insert("Counterparty", Parameters.CounterpartyForFilter);
	EndIf;
	
	If Parameters.Property("EmployeeForFilter") 
		AND ValueIsFilled(Parameters.EmployeeForFilter) 
		AND ((Parameters.Property("OperationType") 
				AND Parameters.OperationType = Enums.LoanAccrualTypes.AccrualsForEmployeeLoans)
			OR Not Parameters.Property("OperationType")) Then
				Parameters.Filter.Insert("Employee", Parameters.EmployeeForFilter);
	EndIf;
	
EndProcedure

#EndRegion
